# CannotDuplicateInOptionWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotDuplicateInOptionWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Elements can't be duplicated in a secondary Option
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDuplicateInOptionWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDuplicateInOptionWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDuplicateInOptionWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace